<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"1dea6c9f94e58cc4e8aadb9b4a442b0534c2f2a65b9c4f0e1e25c763b68882cf","plan_job_ref":"Job Terraform Plan #120 at https://github.com/cal-itp/data-infra/actions/runs/14500183250","plan_out_hash":"88e52afafc5bfa8d24c391829f8119adeab695b26ce9f45adcee0c6d77969c65","plan_hash":"dbfd3e8a837421c6618acadce7c69b6328942c1aeb456d347168cad02f9d6608","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/iam/us__
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_project_iam_custom_role.calitp-dds-analyst will be created
+   resource "google_project_iam_custom_role" "calitp-dds-analyst" {
+       deleted     = (known after apply)
+       description = "Custom role for DDS Analysts"
+       id          = (known after apply)
+       name        = (known after apply)
+       permissions = [
+           "viewer",
        ]
+       project     = "cal-itp-data-infra-staging"
+       role_id     = "***********"
+       stage       = "GA"
+       title       = "DDS Analyst"
    }

  # google_project_iam_member.DOT_DDS_Data_Pipeline_and_Warehouse_Users will be created
+   resource "google_project_iam_member" "DOT_DDS_Data_Pipeline_and_Warehouse_Users" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "principalSet://iam.googleapis.com/locations/global/workforcePools/dot-ca-gov/group/DOT_DDS_Data_Pipeline_and_Warehouse_Users"
+       project = "cal-itp-data-infra-staging"
+       role    = (known after apply)
    }

  # google_project_iam_member.github-actions-service-account["roles/bigquery.dataViewer"] will be created
+   resource "google_project_iam_member" "github-actions-service-account" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:github-actions-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com"
+       project = "cal-itp-data-infra-staging"
+       role    = "roles/bigquery.dataViewer"
    }

  # google_project_iam_member.github-actions-service-account["roles/bigquery.jobUser"] will be created
+   resource "google_project_iam_member" "github-actions-service-account" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:github-actions-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com"
+       project = "cal-itp-data-infra-staging"
+       role    = "roles/bigquery.jobUser"
    }

  # google_project_iam_member.github-actions-service-account["roles/bigquery.readSessionUser"] will be created
+   resource "google_project_iam_member" "github-actions-service-account" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:github-actions-service-account@cal-itp-data-infra-staging.iam.gserviceaccount.com"
+       project = "cal-itp-data-infra-staging"
+       role    = "roles/bigquery.readSessionUser"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #120](https://github.com/cal-itp/data-infra/actions/runs/14500183250)